[
  {
    "id": 1,
    "englishName": "Bereishit",
    "hebrewName": "בְּרֵאשִׁית",
    "book": "Genesis",
    "refs": ["Genesis 1:1–6:8"],
    "shortSummary": "The story of beginnings: creation, the first humans, and the dawn of humanity’s struggles.",
    "summary": "In the opening chapters we are carried through the breathtaking moment of creation — light and sky, seas and earth, plants, animals — until humanity appears at the center. Adam and Eve explore the gift of a garden and the painful discovery of choice and consequence. Cain and Abel’s tragedy shows how jealousy can fracture relationships, and as people multiply, the world grows more complex and fragile. The parsha sets the stage for an ongoing story about human longing, responsibility, and the promise of renewal.",
    "startDate": "2025-10-18",
    "endDate": "2025-10-24"
  },
  {
    "id": 2,
    "englishName": "Noach",
    "hebrewName": "נֹחַ",
    "book": "Genesis",
    "refs": ["Genesis 6:9–11:32"],
    "shortSummary": "Noah's ark, the flood, and the covenant of the rainbow.",
    "summary": "God observes the corruption of humanity and decides to cleanse the earth with a flood. Noah, a righteous man, is chosen to build an ark to save his family and pairs of every animal species. After the floodwaters recede, Noah and his family emerge to repopulate the earth. God establishes a covenant with Noah, symbolized by the rainbow, promising never to destroy the earth by flood again.",
    "startDate": "2025-10-25",
    "endDate": "2025-10-31"
  },
  {
    "id": 3,
    "englishName": "Lech Lecha",
    "hebrewName": "לֶךְ-לְךָ",
    "book": "Genesis",
    "refs": ["Genesis 12:1–17:27"],
    "shortSummary": "God's call to Abram to journey to Canaan and the covenant of circumcision.",
    "summary": "God commands Abram to leave his homeland and journey to a land that He will show him. Abram, accompanied by his wife Sarai and nephew Lot, travels to Canaan. God promises to make Abram a great nation. Abram's faith is tested through various challenges, including a sojourn in Egypt and the separation from Lot. God establishes a covenant with Abram, instituting the practice of circumcision as a sign of this covenant.",
    "startDate": "2025-11-01",
    "endDate": "2025-11-07"
  },
  {
    "id": 4,
    "englishName": "Vayera",
    "hebrewName": "וַיֵּרָא",
    "book": "Genesis",
    "refs": ["Genesis 18:1–22:24"],
    "shortSummary": "The visitation of three angels, the destruction of Sodom and Gomorrah, and the binding of Isaac.",
    "summary": "Three angels visit Abraham and foretell the birth of Isaac. Abraham intercedes on behalf of Sodom, but the city is destroyed due to its wickedness. Lot and his daughters flee to Zoar. Sarah gives birth to Isaac. God commands Abraham to sacrifice Isaac, and at the last moment, an angel stops him, providing a ram as a substitute offering. Abraham's faith is reaffirmed, and God blesses him with promises of descendants and land.",
    "startDate": "2025-11-08",
    "endDate": "2025-11-14"
  },
  {
    "id": 5,
    "englishName": "Chayei Sarah",
    "hebrewName": "חַיֵּי שָׂרָה",
    "book": "Genesis",
    "refs": ["Genesis 23:1–25:18"],
    "shortSummary": "The death of Sarah, the marriage of Isaac and Rebekah, and the death of Abraham.",
    "summary": "Sarah passes away, and Abraham purchases the Cave of Machpelah as a burial site. Abraham sends his servant to find a wife for Isaac, leading to the meeting with Rebekah. Isaac marries Rebekah, and they have twin sons, Esau and Jacob. Abraham remarries Keturah and has additional children. Abraham dies and is buried beside Sarah. The parsha concludes with a genealogy of Abraham's descendants.",
    "startDate": "2025-11-15",
    "endDate": "2025-11-21"
  },
  {
    "id": 6,
    "englishName": "Toldot",
    "hebrewName": "תּוֹלְדוֹת",
    "book": "Genesis",
    "refs": ["Genesis 25:19–28:9"],
    "shortSummary": "The birth of Esau and Jacob, and the sale of the birthright.",
    "summary": "Isaac and Rebekah struggle with infertility but eventually have twin sons, Esau and Jacob. Esau sells his birthright to Jacob for a bowl of lentil stew. Isaac, fearing famine, moves to Gerar, where he repeats his father's deception about his wife. Isaac prospers in the land, leading to envy from the Philistines. He reopens the wells dug by Abraham and establishes peace with Abimelech, the king of the Philistines.",
    "startDate": "2025-11-22",
    "endDate": "2025-11-28"
  },
  {
    "id": 7,
    "englishName": "Vayetzei",
    "hebrewName": "וַיֵּצֵא",
    "book": "Genesis",
    "refs": ["Genesis 28:10–32:3"],
    "shortSummary": "Jacob's dream at Bethel, his marriage to Leah and Rachel, and his departure from Laban.",
    "summary": "Jacob leaves Beersheba and dreams of a ladder reaching to heaven at Bethel. He arrives in Haran and meets Rachel at the well. Jacob agrees to work for Laban in exchange for marrying Rachel, but is deceived into marrying Leah first. He marries Rachel a week later and works for Laban for many more years. Jacob prospers, and tensions rise between him and Laban. Jacob decides to leave, taking his family and possessions.",
    "startDate": "2025-11-29",
    "endDate": "2025-12-05"
  },
  {
    "id": 8,
    "englishName": "Vayishlach",
    "hebrewName": "וַיֵּשַׁׁלַח",
    "book": "Genesis",
    "refs": ["Genesis 32:4–36:43"],
    "shortSummary": "Jacob's reconciliation with Esau, the rape of Dinah, and the death of Rachel.",
    "summary": "Jacob prepares to meet Esau, sending gifts ahead to appease him. The night before the encounter, Jacob wrestles with a mysterious man and is renamed Israel. Jacob and Esau meet and reconcile. Dinah, Jacob's daughter, is raped by Shechem, leading to a violent retaliation by her brothers. Rachel dies giving birth to Benjamin. Isaac dies and is buried by Jacob and Esau.",
    "startDate": "2025-12-06",
    "endDate": "2025-12-12"
  },
  {
    "id": 9,
    "englishName": "Vayeshev",
    "hebrewName": "וַיֵּשֶׁׁב",
    "book": "Genesis",
    "refs": ["Genesis 37:1–40:23"],
    "shortSummary": "Joseph's dreams, his brothers' jealousy, and his rise in Egypt.",
    "summary": "Jacob favors Joseph, giving him a multicolored coat, which incites jealousy in his brothers. They plot to kill him but instead sell him into slavery in Egypt. Joseph rises to prominence in Potiphar's house but is falsely accused by Potiphar's wife and imprisoned. While in prison, Joseph interprets the dreams of Pharaoh's cupbearer and baker, setting the stage for his later rise to power.",
    "startDate": "2025-12-13",
    "endDate": "2025-12-19"
  },
  {
    "id": 10,
    "englishName": "Miketz",
    "hebrewName": "מִקֵּץ",
    "book": "Genesis",
    "refs": ["Genesis 41:1–44:17"],
    "shortSummary": "Joseph interprets Pharaoh's dreams and his brothers' second visit to Egypt.",
    "summary": "Pharaoh has troubling dreams, and Joseph interprets them, predicting seven years of plenty followed by seven years of famine. Joseph is appointed as viceroy of Egypt to prepare for the coming famine. During the famine, Jacob sends his sons to Egypt for grain. They encounter Joseph, who recognizes them but they do not recognize him. Joseph accuses them of being spies and demands that they bring their youngest brother, Benjamin, to prove their honesty.",
    "startDate": "2025-12-20",
    "endDate": "2025-12-26"
  },
  {
    "id": 11,
    "englishName": "Vayigash",
    "hebrewName": "וַיֵּגַש",
    "book": "Genesis",
    "refs": ["Genesis 44:18–47:27"],
    "shortSummary": "Judah's plea for Benjamin, Joseph reveals his identity, and Jacob's family moves to Egypt.",
    "summary": "Judah pleads with Joseph to release Benjamin, offering himself as a substitute. Joseph reveals his identity to his brothers and forgives them for selling him into slavery. He invites his father and family to come to Egypt to escape the famine. Pharaoh provides them with land in Goshen. Jacob and his family move to Egypt, fulfilling God's promise to Abraham.",
    "startDate": "2025-12-27",
    "endDate": "2026-01-02"
  },
  {
    "id": 12,
    "englishName": "Vayechi",
    "hebrewName": "וַיְחִי",
    "book": "Genesis",
    "refs": ["Genesis 47:28–50:26"],
    "shortSummary": "Jacob's final days, his blessings to his sons, and Joseph's death.",
    "summary": "Jacob lives his final years in Egypt, surrounded by his family. Before his death, he blesses each of his sons, prophesying their futures and solidifying their legacy. Jacob is embalmed and buried in Canaan. Afterward, Joseph reassures his brothers of his forgiveness and dies at the age of 110, leaving a lasting legacy in Egypt.",
    "startDate": "2026-01-03",
    "endDate": "2026-01-10"
  },
  {
    "id": 13,
    "englishName": "Shemot",
    "hebrewName": "שְׁמוֹת",
    "book": "Exodus",
    "refs": ["Exodus 1:1–6:1"],
    "shortSummary": "The Israelites multiply in Egypt, and a new Pharaoh oppresses them.",
    "summary": "The descendants of Jacob settle in Egypt and grow into a large nation. A new Pharaoh, who does not remember Joseph, enslaves the Israelites and subjects them to harsh labor. God calls Moses to lead the Israelites out of Egypt, setting the stage for their eventual redemption.",
    "startDate": "2026-01-11",
    "endDate": "2026-01-18"
  },
  {
    "id": 14,
    "englishName": "Va'era",
    "hebrewName": "וָאֵרָא",
    "book": "Exodus",
    "refs": ["Exodus 6:2–9:35"],
    "shortSummary": "God begins to deliver Israel through the plagues on Egypt.",
    "summary": "God tells Moses that He will fulfill His promise to redeem the Israelites. Moses confronts Pharaoh, and God sends the first seven plagues to demonstrate His power and compel Pharaoh to release His people. Despite the devastation, Pharaoh’s heart remains hardened.",
    "startDate": "2026-01-03",
    "endDate": "2026-01-09"
  },
  {
    "id": 15,
    "englishName": "Bo",
    "hebrewName": "בֹּא",
    "book": "Exodus",
    "refs": ["Exodus 10:1–13:16"],
    "shortSummary": "The final plagues and the Exodus from Egypt.",
    "summary": "God sends the final three plagues upon Egypt: locusts, darkness, and the death of the firstborn. Pharaoh finally lets the Israelites go. Moses institutes the Passover, commanding the people to mark their doors with lamb's blood as a sign for God to pass over them during the plague of the firstborn.",
    "startDate": "2026-01-10",
    "endDate": "2026-01-16"
  },
  {
    "id": 16,
    "englishName": "Beshalach",
    "hebrewName": "בְּשַׁלַח",
    "book": "Exodus",
    "refs": ["Exodus 13:17–17:16"],
    "shortSummary": "The Israelites cross the Red Sea and begin their journey in the desert.",
    "summary": "After leaving Egypt, the Israelites are pursued by Pharaoh’s army. God miraculously splits the Red Sea, allowing Israel to cross safely and drowning the Egyptians. The people sing praises, and God provides water and sustenance in the desert. The Amalekites attack, but Israel prevails with Moses’ leadership and God’s support.",
    "startDate": "2026-01-17",
    "endDate": "2026-01-23"
  },
  {
    "id": 17,
    "englishName": "Yitro",
    "hebrewName": "יִתְרוֹ",
    "book": "Exodus",
    "refs": ["Exodus 18:1–20:23"],
    "shortSummary": "Jethro advises Moses, and the Israelites receive the Ten Commandments.",
    "summary": "Jethro, Moses’ father-in-law, visits and advises him to delegate judicial responsibilities to capable leaders. The Israelites gather at Mount Sinai, and God reveals Himself with thunder, lightning, and smoke. Moses receives the Ten Commandments, laying the foundation for Israel’s covenant with God.",
    "startDate": "2026-01-24",
    "endDate": "2026-01-30"
  },
  {
    "id": 18,
    "englishName": "Mishpatim",
    "hebrewName": "מִּשְׁפָּטִים",
    "book": "Exodus",
    "refs": ["Exodus 21:1–24:18"],
    "shortSummary": "Laws governing social, civil, and religious life are given.",
    "summary": "God provides detailed laws covering slavery, justice, property, and interpersonal relations. The Israelites accept God’s covenant, and Moses ascends Mount Sinai to receive the tablets. These laws establish the framework for ethical and religious conduct in Israelite society.",
    "startDate": "2026-01-31",
    "endDate": "2026-02-06"
  },
  {
    "id": 19,
    "englishName": "Terumah",
    "hebrewName": "תְּרוּמָה",
    "book": "Exodus",
    "refs": ["Exodus 25:1–27:19"],
    "shortSummary": "Instructions are given for building the Tabernacle.",
    "summary": "God commands the Israelites to bring contributions to construct the Mishkan (Tabernacle). Detailed specifications are given for the Ark, table, menorah, and other sacred furnishings, emphasizing craftsmanship, holiness, and dedication.",
    "startDate": "2026-02-07",
    "endDate": "2026-02-13"
  },
  {
    "id": 20,
    "englishName": "Tetzaveh",
    "hebrewName": "תְּצַוֶּה",
    "book": "Exodus",
    "refs": ["Exodus 27:20–30:10"],
    "shortSummary": "Priestly garments and rituals are detailed.",
    "summary": "God instructs Moses on the creation of the priests’ special garments, including the ephod, breastplate, and tunics. Instructions are given for the consecration of Aaron and his sons, and details are provided for daily offerings, emphasizing holiness and the centrality of worship in Israelite life.",
    "startDate": "2026-02-14",
    "endDate": "2026-02-20"
  },
  {
    "id": 21,
    "englishName": "Ki Tisa",
    "hebrewName": "כִּי תִשָּׂא",
    "book": "Exodus",
    "refs": ["Exodus 30:11–34:35"],
    "shortSummary": "The sin of the golden calf and God’s forgiveness.",
    "summary": "While Moses is on Mount Sinai, the Israelites build a golden calf and worship it, angering God. Moses intercedes, and God forgives the people. New tablets are carved, and God renews the covenant, revealing His attributes of mercy and compassion.",
    "startDate": "2026-02-21",
    "endDate": "2026-02-27"
  },
  {
    "id": 22,
    "englishName": "Vayakhel",
    "hebrewName": "וַיַּקְהֵל",
    "book": "Exodus",
    "refs": ["Exodus 35:1–38:20"],
    "shortSummary": "The Israelites gather to build the Tabernacle.",
    "summary": "Moses assembles the Israelites and reiterates God’s commands regarding the Mishkan. The people generously donate materials, and skilled artisans construct the Ark, menorah, and other sacred items. The community unites in obedience and devotion, fulfilling God’s instructions.",
    "startDate": "2026-02-28",
    "endDate": "2026-03-05"
  },
  {
    "id": 23,
    "englishName": "Pekudei",
    "hebrewName": "פְּקוּדֵי",
    "book": "Exodus",
    "refs": ["Exodus 38:21–40:38"],
    "shortSummary": "The Tabernacle is completed and God’s presence fills it.",
    "summary": "A detailed accounting of the materials used in the Mishkan is provided. Moses inspects the completed Tabernacle and blesses the people. God’s glory fills the Mishkan, confirming His presence among the Israelites and signaling the culmination of their sacred work.",
    "startDate": "2026-03-06",
    "endDate": "2026-03-12"
  },
  {
    "id": 24,
    "englishName": "Vayikra",
    "hebrewName": "וַיִּקְרָא",
    "book": "Leviticus",
    "refs": ["Leviticus 1:1–5:26"],
    "shortSummary": "God calls Moses and gives instructions on sacrifices.",
    "summary": "God summons Moses from the Tabernacle and instructs him on the laws of korbanot (sacrifices), including burnt offerings, meal offerings, and sin offerings. The parsha emphasizes the importance of intention, ritual purity, and approaching God with reverence.",
    "startDate": "2026-03-13",
    "endDate": "2026-03-19"
  },
  {
    "id": 25,
    "englishName": "Tzav",
    "hebrewName": "צַו",
    "book": "Leviticus",
    "refs": ["Leviticus 6:1–8:36"],
    "shortSummary": "Instructions for priests and offerings are given.",
    "summary": "God commands Moses to instruct Aaron and his sons on the proper procedures for offerings, including burnt, grain, sin, and guilt offerings. The parsha details the consecration of the priests, emphasizing holiness, ritual precision, and the central role of the priesthood in mediating between God and Israel.",
    "startDate": "2026-03-20",
    "endDate": "2026-03-26"
  },
  {
    "id": 26,
    "englishName": "Shemini",
    "hebrewName": "שְׁמִינִי",
    "book": "Leviticus",
    "refs": ["Leviticus 9:1–11:47"],
    "shortSummary": "The Tabernacle service begins; Nadav and Avihu die.",
    "summary": "Aaron and his sons begin their service in the Tabernacle. Nadav and Avihu offer unauthorized fire and are consumed by divine fire. God gives laws on kosher and non-kosher animals, emphasizing holiness, obedience, and the sanctity of worship.",
    "startDate": "2026-03-27",
    "endDate": "2026-04-02"
  },
  {
    "id": 27,
    "englishName": "Tazria",
    "hebrewName": "תַּזְרִיעַ",
    "book": "Leviticus",
    "refs": ["Leviticus 12:1–13:59"],
    "shortSummary": "Laws on childbirth and skin diseases are given.",
    "summary": "God instructs Moses on the laws of ritual purity after childbirth and how to identify and handle tzara’at (skin afflictions). The parsha emphasizes cleanliness, community responsibility, and separation between the holy and the impure.",
    "startDate": "2026-04-03",
    "endDate": "2026-04-09"
  },
  {
    "id": 28,
    "englishName": "Metzora",
    "hebrewName": "מְּצֹרָע",
    "book": "Leviticus",
    "refs": ["Leviticus 14:1–15:33"],
    "shortSummary": "Laws for the purification of tzara’at and bodily discharges.",
    "summary": "Moses instructs the Israelites on how to purify someone who had tzara’at, including offerings and rituals. Laws regarding bodily discharges are also explained. The parsha highlights holiness, ritual cleanliness, and reintegration into the community.",
    "startDate": "2026-04-10",
    "endDate": "2026-04-16"
  },
  {
    "id": 29,
    "englishName": "Acharei Mot",
    "hebrewName": "אַחֲרֵי מוֹת",
    "book": "Leviticus",
    "refs": ["Leviticus 16:1–18:30"],
    "shortSummary": "Yom Kippur rituals and forbidden sexual relations are outlined.",
    "summary": "God commands the rituals for Yom Kippur, including the scapegoat ceremony, to atone for Israel’s sins. Laws forbidding certain sexual relationships are given, emphasizing holiness, moral conduct, and the sanctity of life within the community.",
    "startDate": "2026-04-17",
    "endDate": "2026-04-23"
  },
  {
    "id": 30,
    "englishName": "Kedoshim",
    "hebrewName": "קְדֹשִׁים",
    "book": "Leviticus",
    "refs": ["Leviticus 19:1–20:27"],
    "shortSummary": "Laws of holiness and ethical conduct are given.",
    "summary": "God commands the Israelites to be holy in all aspects of life. The parsha includes ethical directives, including justice, charity, honesty, and respect for parents and the vulnerable. It combines ritual, moral, and social commandments, emphasizing holiness as a comprehensive way of life.",
    "startDate": "2026-04-24",
    "endDate": "2026-04-30"
  },
  {
    "id": 31,
    "englishName": "Emor",
    "hebrewName": "אֵמוֹר",
    "book": "Leviticus",
    "refs": ["Leviticus 21:1–24:23"],
    "shortSummary": "Laws for priests, holy days, and the menorah are given.",
    "summary": "God instructs Moses on the conduct of priests, restrictions on their behavior, and their special role. Festivals, offerings, and the lighting of the menorah are outlined. The parsha emphasizes the sanctity of priesthood and the communal rhythm of worship.",
    "startDate": "2026-05-01",
    "endDate": "2026-05-07"
  },
  {
    "id": 32,
    "englishName": "Behar",
    "hebrewName": "בְּהַר",
    "book": "Leviticus",
    "refs": ["Leviticus 25:1–26:2"],
    "shortSummary": "Laws of the Sabbatical year and Jubilee are given.",
    "summary": "God instructs Moses on the Sabbatical year (Shmita), when the land rests every seven years, and the Jubilee year (Yovel), occurring every 50 years, when land returns to its original owners and slaves are freed. These laws emphasize social justice, economic balance, and trust in God’s providence.",
    "startDate": "2026-05-08",
    "endDate": "2026-05-14"
  },
  {
  "id": 33,
    "englishName": "Bechukotai",
    "hebrewName": "בְּחֻקֹּתַי",
    "book": "Leviticus",
    "refs": ["Leviticus 26:3–27:34"],
    "shortSummary": "Blessings for obedience and warnings for disobedience are given.",
    "summary": "God promises blessings for following His commandments, including prosperity, peace, and protection. Conversely, disobedience brings curses and exile. The parsha concludes with laws concerning vows and dedications, emphasizing accountability, covenantal faithfulness, and the moral structure of the Israelite community.",
    "startDate": "2026-05-15",
    "endDate": "2026-05-21"
  },
  {
    "id": 34,
    "englishName": "Bamidbar",
    "hebrewName": "בְּמִדְבַּר",
    "book": "Numbers",
    "refs": ["Numbers 1:1–4:20"],
    "shortSummary": "Census of the Israelites and organization of the camp.",
    "summary": "God commands Moses to take a census of all Israelite men eligible for military service. The tribes are organized around the Tabernacle, with designated positions for leaders, Levites, and warriors. This arrangement emphasizes order, community structure, and readiness for the journey through the desert.",
    "startDate": "2026-05-22",
    "endDate": "2026-05-28"
  },
  {
    "id": 35,
    "englishName": "Naso",
    "hebrewName": "נָשֹׂא",
    "book": "Numbers",
    "refs": ["Numbers 4:21–7:89"],
    "shortSummary": "Census of Levites, laws of the Nazirite, and offerings of the leaders.",
    "summary": "God commands a census of the Levites for their service in the Tabernacle. Laws regarding Nazirites, who take vows of dedication, are explained. Each tribal leader brings offerings for the dedication of the altar. The parsha emphasizes service, holiness, and communal celebration.",
    "startDate": "2026-05-29",
    "endDate": "2026-06-04"
  },
  {
    "id": 36,
    "englishName": "Beha’alotcha",
    "hebrewName": "בְּהַאֲלֹתְךָ",
    "book": "Numbers",
    "refs": ["Numbers 8:1–12:16"],
    "shortSummary": "Lighting the menorah, the Levites' service, and the Israelites’ journey begins.",
    "summary": "God commands the lighting of the menorah in the Tabernacle and the consecration of the Levites. The Israelites begin their journey from Sinai, guided by the cloud. Complaints arise, Miriam and Aaron challenge Moses, and God affirms Moses’ leadership. The parsha emphasizes obedience, leadership, and divine guidance.",
    "startDate": "2026-06-05",
    "endDate": "2026-06-11"
  },
  {
    "id": 37,
    "englishName": "Shlach Lecha",
    "hebrewName": "שְׁלַח־לְךָ",
    "book": "Numbers",
    "refs": ["Numbers 13:1–15:41"],
    "shortSummary": "The spies are sent to Canaan, and Israel rebels.",
    "summary": "Moses sends twelve spies to scout the land of Canaan. Ten spies return with a fearful report, discouraging the people, while Caleb and Joshua show faith in God. The Israelites rebel, refusing to enter the land, and God decrees that the current generation will wander in the desert for 40 years.",
    "startDate": "2026-06-12",
    "endDate": "2026-06-18"
  },
  {
    "id": 38,
    "englishName": "Korach",
    "hebrewName": "קֹרַח",
    "book": "Numbers",
    "refs": ["Numbers 16:1–18:32"],
    "shortSummary": "Korach’s rebellion against Moses and Aaron.",
    "summary": "Korach, Dathan, and Abiram lead a rebellion questioning Moses’ and Aaron’s leadership. God punishes the rebels dramatically, and the priesthood and Levite duties are reaffirmed. The parsha emphasizes divine authority, leadership legitimacy, and the consequences of rebellion.",
    "startDate": "2026-06-19",
    "endDate": "2026-06-25"
  },
  {
    "id": 39,
    "englishName": "Chukat",
    "hebrewName": "חֻקַּת",
    "book": "Numbers",
    "refs": ["Numbers 19:1–22:1"],
    "shortSummary": "The red heifer ritual and the deaths of Miriam and Aaron.",
    "summary": "God commands the ritual of the red heifer for purification from impurity. The Israelites journey through the desert, Miriam dies, and the community mourns. Water is provided from the rock, but Moses and Aaron sin and are denied entry into Canaan. Battles with surrounding nations emphasize divine support and Israel’s dependence on God.",
    "startDate": "2026-06-26",
    "endDate": "2026-07-02"
  },
  {
    "id": 40,
    "englishName": "Balak",
    "hebrewName": "בָּלָק",
    "book": "Numbers",
    "refs": ["Numbers 22:2–25:9"],
    "shortSummary": "King Balak hires Balaam to curse Israel, but blessings are pronounced instead.",
    "summary": "Balak, king of Moab, fears the Israelites and hires Balaam to curse them. God intervenes, and Balaam ends up blessing Israel repeatedly. The parsha also includes the sin of Peor, where Israelites engage in idolatry and immorality, leading to plague and repentance.",
    "startDate": "2026-07-03",
    "endDate": "2026-07-09"
  },
  {
    "id": 41,
    "englishName": "Pinchas",
    "hebrewName": "פִּינְחָס",
    "book": "Numbers",
    "refs": ["Numbers 25:10–30:1"],
    "shortSummary": "Pinchas’ zeal, census of new generation, and vows.",
    "summary": "Pinchas demonstrates zeal by stopping idolatry among the Israelites, earning God’s covenant of peace. A new census is taken of the next generation destined to enter Canaan. Laws regarding vows, offerings, and inheritance are detailed, emphasizing devotion, responsibility, and communal organization.",
    "startDate": "2026-07-10",
    "endDate": "2026-07-16"
  },
  {
    "id": 42,
    "englishName": "Matot",
    "hebrewName": "מַּטּוֹת",
    "book": "Numbers",
    "refs": ["Numbers 30:2–32:42"],
    "shortSummary": "Laws on vows and the war against Midian.",
    "summary": "God instructs Moses on the obligations of vows, particularly for women. The Israelites wage war against Midian, following God’s command, and divide the spoils. Tribal boundaries are assigned, and the tribes of Reuben and Gad request land on the east side of the Jordan, promising to assist in conquering Canaan.",
    "startDate": "2026-07-17",
    "endDate": "2026-07-23"
  },
  {
    "id": 43,
    "englishName": "Masei",
    "hebrewName": "מַסְעֵי",
    "book": "Numbers",
    "refs": ["Numbers 33:1–36:13"],
    "shortSummary": "Journey of Israel and instructions before entering Canaan.",
    "summary": "Moses recounts the stages of the Israelites’ journey from Egypt to the plains of Moab. Laws regarding cities of refuge, inheritance, and the boundaries of the land are given. The parsha emphasizes preparation, order, and faithfulness as Israel nears the Promised Land.",
    "startDate": "2026-07-24",
    "endDate": "2026-07-30"
  },
  {
    "id": 44,
    "englishName": "Devarim",
    "hebrewName": "דְּבָרִים",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 1:1–3:22"],
    "shortSummary": "Moses begins his farewell speeches to Israel.",
    "summary": "Moses recounts Israel’s journey, reviewing their history, trials, and God’s guidance. He prepares the people for entering Canaan, urging obedience to God’s laws. The parsha emphasizes remembrance, leadership, and the covenantal relationship between God and Israel.",
    "startDate": "2026-07-31",
    "endDate": "2026-08-06"
  },
  {
    "id": 45,
    "englishName": "Va'etchanan",
    "hebrewName": "וָאֶתְחַנַּן",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 3:23–7:11"],
    "shortSummary": "Moses pleads to enter the Promised Land and repeats the Ten Commandments.",
    "summary": "Moses appeals to God to allow him entry into Canaan, but God refuses. He reiterates the Ten Commandments and exhorts Israel to follow God’s laws. The parsha stresses loyalty, obedience, and love for God as Israel prepares for the land ahead.",
    "startDate": "2026-08-07",
    "endDate": "2026-08-13"
  },
  {
    "id": 46,
    "englishName": "Eikev",
    "hebrewName": "עֵקֶב",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 7:12–11:25"],
    "shortSummary": "Blessings for obedience and warnings against idolatry.",
    "summary": "Moses promises blessings for obedience to God’s commandments and warns against forgetting God and turning to idolatry. He reminds Israel of God’s faithfulness and the importance of love, humility, and commitment. The parsha emphasizes reward, responsibility, and covenantal fidelity.",
    "startDate": "2026-08-14",
    "endDate": "2026-08-20"
  },
  {
    "id": 47,
    "englishName": "Re'eh",
    "hebrewName": "רְאֵה",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 11:26–16:17"],
    "shortSummary": "Blessings and curses, and centralization of worship.",
    "summary": "Moses presents a choice between blessings for obedience and curses for disobedience. He commands the Israelites to centralize worship in the place God will choose and outlines festivals and tithes. The parsha stresses free will, accountability, and the importance of sincere worship.",
    "startDate": "2026-08-21",
    "endDate": "2026-08-27"
},
  {
    "id": 48,
    "englishName": "Shoftim",
    "hebrewName": "שֹׁפְטִים",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 16:18–21:9"],
    "shortSummary": "Laws on judges, kings, and justice.",
    "summary": "Moses instructs Israel to appoint judges and officers who administer justice impartially. Laws for kings, prophets, and cities of refuge are given. The parsha emphasizes justice, leadership responsibility, and the centrality of law in maintaining societal and spiritual order.",
    "startDate": "2026-08-28",
    "endDate": "2026-09-03"
  },
  {
    "id": 49,
    "englishName": "Ki Teitzei",
    "hebrewName": "כִּי־תֵצֵא",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 21:10–25:19"],
    "shortSummary": "Various laws on ethical conduct and social responsibility.",
    "summary": "Moses gives a series of laws covering war, family, property, justice, and morality. The parsha emphasizes ethical behavior, protection of the vulnerable, and maintaining holiness in everyday life. It underscores the integration of law and morality in Israelite society.",
    "startDate": "2026-09-04",
    "endDate": "2026-09-10"
  },
  {
    "id": 50,
    "englishName": "Ki Tavo",
    "hebrewName": "כִּי־תָבוֹא",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 26:1–29:8"],
    "shortSummary": "First fruits, tithes, and blessings and curses.",
    "summary": "Moses commands the Israelites to bring first fruits and tithes and recount God’s deeds. He sets forth blessings for obedience and curses for disobedience, emphasizing covenantal fidelity and collective responsibility for upholding the law.",
    "startDate": "2026-09-11",
    "endDate": "2026-09-17"
  },
  {
    "id": 51,
    "englishName": "Nitzavim",
    "hebrewName": "נִצָּבִים",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 29:9–30:20"],
    "shortSummary": "Renewal of the covenant and call to choose life.",
    "summary": "Moses stands with all Israel to renew the covenant. He exhorts the people to choose life by following God’s commandments and warns against rebellion. The parsha emphasizes collective responsibility, choice, and the enduring relationship between God and Israel.",
    "startDate": "2026-09-18",
    "endDate": "2026-09-24"
  },
  {
    "id": 52,
    "englishName": "Vayelech",
    "hebrewName": "וַיֵּלֶךְ",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 31:1–30"],
    "shortSummary": "Moses prepares for his death and Joshua’s leadership.",
    "summary": "Moses addresses Israel, knowing he will not enter Canaan. He appoints Joshua as leader and encourages the people to remain faithful to God. The parsha stresses leadership succession, obedience, and faithfulness to the covenant.",
    "startDate": "2026-09-25",
    "endDate": "2026-10-01"
  },
  {
    "id": 53,
    "englishName": "Ha'Azinu",
    "hebrewName": "הַאֲזִינוּ",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 32:1–52"],
    "shortSummary": "Moses’ song recounts Israel’s history and God’s justice.",
    "summary": "Moses delivers a poetic song teaching Israel about God’s faithfulness, Israel’s failures, and the consequences of obedience and disobedience. The song emphasizes divine justice, covenantal fidelity, and the lessons of history for the people.",
    "startDate": "2026-10-02",
    "endDate": "2026-10-08"
  },
  {
    "id": 54,
    "englishName": "V'Zot HaBerachah",
    "hebrewName": "וְזוֹת הַבְּרָכָה",
    "book": "Deuteronomy",
    "refs": ["Deuteronomy 33:1–34:12"],
    "shortSummary": "Moses blesses the tribes and dies on Mount Nebo.",
    "summary": "Moses blesses each of the twelve tribes of Israel, predicting their future. He ascends Mount Nebo, views the Promised Land, and dies, and God Himself buries him. Joshua succeeds him as leader, and the Torah concludes with the transition to the next generation poised to enter Canaan.",
    "startDate": "2026-10-09",
    "endDate": "2026-10-15"
  }
]