[
  {
    "id": 1,
    "englishName": "Bereishit",
    "hebrewName": "בְּרֵאשִׁית",
    "book": "Genesis",
    "refs": ["Genesis 1:1–6:8"],
    "shortSummary": "The story of beginnings: creation, the first humans, and the dawn of humanity’s struggles.",
    "summary": "In the opening chapters we are carried through the breathtaking moment of creation — light and sky, seas and earth, plants, animals — until humanity appears at the center. Adam and Eve explore the gift of a garden and the painful discovery of choice and consequence. Cain and Abel’s tragedy shows how jealousy can fracture relationships, and as people multiply, the world grows more complex and fragile. The parsha sets the stage for an ongoing story about human longing, responsibility, and the promise of renewal.",
    "date": "2025-10-18"
  },
  {
    "id": 2,
    "englishName": "Noach",
    "hebrewName": "נֹחַ",
    "book": "Genesis",
    "refs": ["Genesis 6:9–11:32"],
    "shortSummary": "The flood, the ark, and the promise of a new world.",
    "summary": "Noach, a righteous man in a corrupt world, is chosen to preserve life when God decides to cleanse the earth with a great flood. He builds the ark, gathering his family and every species of creature. After the waters subside, God makes a covenant, symbolized by the rainbow, never to destroy the earth again by flood. But as humanity rebuilds, pride leads to the Tower of Babel — and once again, people are scattered, learning that unity without humility can be its own downfall.",
    "date": "2025-10-25"
  },
  {
    "id": 3,
    "englishName": "Lech-Lecha",
    "hebrewName": "לך־לך",
    "book": "Genesis",
    "refs": "Genesis 12:1–17:27",
    "shortSummary": "God calls Abram to leave home and begin a journey of faith, identity and promise.",
    "summary": "Abram’s life shifts from settled comfort to restless adventure after a divine summons: leave your land, and I will make you a blessing. He travels with Sarah and Lot, endures famine and conflict, and learns the cost of trusting a promise that stretches beyond his understanding. God’s covenant with Abram — a promise of descendants and land — reshapes his identity. Along the way there are tests, alliances, and the renaming of Abram as Abraham, signaling a transformation that will shape future generations."
  },
  {
    "id": 4,
    "englishName": "Vayera",
    "hebrewName": "וירא",
    "book": "Genesis",
    "refs": "Genesis 18:1–22:24",
    "shortSummary": "Hospitality, a promise fulfilled, moral testing, and Abraham’s greatest trial.",
    "summary": "In Vayera we watch Abraham open his tent to strangers and, in turn, host angels who bring news of Isaac’s impending birth. The parsha moves through laughter and longing as Sarah conceives in her old age, and the drama deepens with Sodom and Gomorrah’s judgment — a moral crisis where Abraham bargains for justice. The climax is the agonizing test on Mount Moriah when Abraham is asked to offer Isaac; the narrative explores faith that risks everything and, ultimately, divine mercy that redirects the path."
  },
  {
    "id": 5,
    "englishName": "Chayei Sarah",
    "hebrewName": "חיי שרה",
    "book": "Genesis",
    "refs": "Genesis 23:1–25:18",
    "shortSummary": "Sarah’s death, Isaac’s marriage, and the passing of the torch to the next generation.",
    "summary": "Chayei Sarah begins with sorrow and ritual as Abraham mourns Sarah and secures a burial place, showing ancient practices of respect and legacy. Abraham sends a trusted servant to find a partner for Isaac, and Rebekah’s arrival is filled with quiet grace: a water-drawing scene that reveals character and destiny. The parsha closes with Abraham’s death and the extension of God’s blessings through Isaac — a changing of the guard that keeps the story of promise moving forward."
  },
  {
    "id": 6,
    "englishName": "Toldot",
    "hebrewName": "תולדות",
    "book": "Genesis",
    "refs": "Genesis 25:19–28:9",
    "shortSummary": "Jacob and Esau, sibling rivalry, and the tangled legacy of blessing and deception.",
    "summary": "Born as twins with opposite temperaments, Jacob and Esau’s lives intertwine around birthright and blessing. Esau’s impulsive choices contrast with Jacob’s calculating patience. A dramatic scene of deception — where Jacob receives Isaac’s blessing — changes family dynamics and forces Jacob to flee. Through quarrel and covenant, the parsha explores how identity and destiny are negotiated in households, how parents’ choices shape children, and how divine purposes can work through flawed human behavior."
  },
  {
    "id": 7,
    "englishName": "Vayetzei",
    "hebrewName": "ויצא",
    "book": "Genesis",
    "refs": "Genesis 28:10–32:3",
    "shortSummary": "Jacob’s journey, ladders and dreams, love and long years of service to win Rachel.",
    "summary": "Jacob’s flight brings him into dreams beneath a starlit sky: a ladder of angels and a God who promises presence wherever Jacob goes. He falls in love with Rachel but is tricked into marrying Leah first — an early lesson in the messy realities of human desire and family. Years of labor, children, and domestic rivalry pass, and Jacob is transformed through toil, relationship, and encounters with the divine. By the end he prepares to confront the past, changed but wrestling with fear and hope."
  },
  {
    "id": 8,
    "englishName": "Vayishlach",
    "hebrewName": "וישלח",
    "book": "Genesis",
    "refs": "Genesis 32:4–36:43",
    "shortSummary": "Jacob meets the angel, reconciles with Esau, and faces the consequences of his family’s choices.",
    "summary": "On the threshold of return, Jacob wrestles all night with a mysterious figure and emerges with a new name — Israel — signaling internal transformation. The tense reunion with Esau dissolves in mercy, an emotional release after years of fear and avoidance. Tragedy and change continue: Dinah’s story brings painful consequences, and Jacob’s household must reckon with identity, exile, and survival. The parsha is a tapestry of reconciliation, wrestling, and the high cost of family conflict."
  },
  {
    "id": 9,
    "englishName": "Vayechi",
    "hebrewName": "וַיְחִי",
    "book": "Genesis",
    "refs": "Genesis 47:28–50:26",
    "shortSummary": "Jacob’s blessings to his sons, Joseph’s final deeds, and an ending that looks ahead.",
    "summary": "In the twilight of Jacob’s life his blessings to the twelve sons reveal prophetic glimpses of the tribes’ futures — tender, cryptic, and full of human insight. Joseph, now a figure of power in Egypt, forgives his brothers and secures promises that the family will not be left behind, ensuring continuity and hope. The book closes with death and burial but with a narrative arc that points toward a people in waiting, preserved amid foreign lands."
  },
  {
    "id": 10,
    "englishName": "Shemot",
    "hebrewName": "שמות",
    "book": "Exodus",
    "refs": "Exodus 1:1–6:1",
    "shortSummary": "A new people oppressed in Egypt; the stage is set for rescue and deliverance.",
    "summary": "Shemot opens a dramatic shift: Jacob’s family has become a multitude, and a new Pharaoh, afraid of their numbers, imposes harsh slavery. Midwives’ courage, Moses’ miraculous survival as an infant, and his mysterious upbringing frame the birth of a leader. The Israelites groan beneath oppression and long for deliverance. The parsha prepares us for an extraordinary intervention — a narrative about memory, identity, and the ways a people are forged through suffering and hope."
  },
  {
    "id": 11,
    "englishName": "Va’eira",
    "hebrewName": "וארא",
    "book": "Exodus",
    "refs": "Exodus 6:2–9:35",
    "shortSummary": "God reveals a name to Moses and the first plagues begin: confrontation and hardening hearts.",
    "summary": "God speaks to Moses in a way that reveals a deeper identity — a God who remembers covenant and hears suffering. Moses and Aaron confront Pharaoh, and the drama of the plagues begins: water turned to blood, frogs, lice, and more, each a confrontation between stubborn earthly power and a divine call for freedom. The narrative shows the complexity of liberation: miracles, warnings, hardened hearts, and the stubborn persistence of injustice despite evidence to the contrary."
  },
  {
    "id": 12,
    "englishName": "Bo",
    "hebrewName": "בּוֹ",
    "book": "Exodus",
    "refs": "Exodus 10:1–13:16",
    "shortSummary": "The last plagues, the first Passover, and the departure from Egypt.",
    "summary": "The story reaches a crescendo: locusts and darkness give way to the terrible finality of the death of the firstborn. The institution of Passover is born — ritual, remembrance, and urgent departure, with blood on doorposts marking households for protection. Pharaoh finally releases the people, and Israel journeys toward the unknown, carrying stories and new rites that will forever mark their identity. Freedom begins amid grief, hurried preparation, and a sense that life will never be the same."
  },
  {
    "id": 13,
    "englishName": "Bamidbar",
    "hebrewName": "במדבר",
    "book": "Numbers",
    "refs": "Numbers 1:1–4:20",
    "shortSummary": "Census and organization: a people counted and arranged for the journey ahead.",
    "summary": "Bamidbar starts with numbers — a census that names and organizes the tribes for life in the desert. The Levites receive special duties, and the camp is arranged with purpose and order. In these preparations we see a transition: the chaos of slavery gives way to structure, responsibility, and the rhythms of communal life. It’s a practical and spiritual recalibration as Israel moves from liberation toward covenantal maturity."
  },
  {
    "id": 14,
    "englishName": "Naso",
    "hebrewName": "נשא",
    "book": "Numbers",
    "refs": "Numbers 4:21–7:89",
    "shortSummary": "Priestly duties, blessings, and the heartwarming dedication of the Tabernacle’s vessels.",
    "summary": "Naso blends ritual and tenderness: the Levites’ roles are clarified, the Nazirite vow is described, and the priestly blessing — a short benediction still used today — offers a poetic invocation of peace. The parsha culminates in the jubilant ceremony of the tribal offerings for the Tabernacle’s dedication, a communal outpouring of devotion and beauty. The text celebrates how religious life combines law, sacrifice, and a desire for blessing and goodwill among people."
  },
  {
    "id": 15,
    "englishName": "Behaalotecha",
    "hebrewName": "בהעלותך",
    "book": "Numbers",
    "refs": "Numbers 8:1–12:16",
    "shortSummary": "Miraculous guidance, the silver trumpets, and the people’s growing challenges.",
    "summary": "Behaalotecha traces both luminous moments and human restlessness: the menorah is rekindled, trumpets summon the community, and the cloud leads the Israelites by day. Yet amid miracles, murmuring bubbles up — impatience and spiritual testing color the journey. Miriam and Aaron speak about Moses, and the text wrestles with leadership’s fragility and the community’s need for steady guidance, mixing wonder with the realities of long desert life."
  },
  {
    "id": 16,
    "englishName": "Shelach",
    "hebrewName": "שלח",
    "book": "Numbers",
    "refs": "Numbers 13:1–15:41",
    "shortSummary": "Spies scout the land; fear creates a crisis that reshapes the people’s future.",
    "summary": "Twelve scouts return from Canaan with mixed reports: fruit and promise on one hand, giants and fear on the other. The people’s reaction — panic and a longing to return to Egypt — shows how perception shapes destiny. Because of distrust, that generation loses the chance to enter the promised land; instead, they are condemned to wander. The parsha is a poignant study of courage and fear, reminding us that trust can open doors while doubt can close them forever."
  },
  {
    "id": 17,
    "englishName": "Korach",
    "hebrewName": "קרח",
    "book": "Numbers",
    "refs": "Numbers 16:1–18:32",
    "shortSummary": "A dramatic rebellion against Moses’ leadership and its hard consequences.",
    "summary": "Korach leads a coalition that challenges Moses and Aaron’s authority, framing a timeless drama of power, jealousy, and the danger of corrosive dissent. The earth itself opens to swallow rebels; a divine test affirms the priesthood’s role and sets boundaries around leadership and sacred service. While the violence is shocking, the parsha probes the tension between righteous protest and destructive rebellion, urging careful reflection on how communities choose leaders and preserve order."
  },
  {
    "id": 18,
    "englishName": "Chukat",
    "hebrewName": "חקת",
    "book": "Numbers",
    "refs": "Numbers 19:1–22:1",
    "shortSummary": "The mysterious red heifer ritual, Moses’ moment of crisis, and continued desert wandering.",
    "summary": "Chukat contains one of the Torah’s most enigmatic laws: the red heifer ritual for purification from ritual impurity — a practice that puzzles scholars but yields profound reflections about life, death, and holiness. Later, a tense episode at the waters of Meribah shows Moses’ human limit: his anger leads to consequences that bar him from entering the promised land. The parsha combines law, mystery, and the tragic glimpses of leadership’s weight."
  },
  {
    "id": 19,
    "englishName": "Balak",
    "hebrewName": "בלק",
    "book": "Numbers",
    "refs": "Numbers 22:2–25:9",
    "shortSummary": "Balak hires Balaam to curse Israel, but the prophet’s words become blessings.",
    "summary": "Balak, king of Moab, fearing Israel’s presence, seeks supernatural aid — Balaam, a prophet for hire. Yet the story subverts expectations: Balaam’s donkey sees the angel and his mouth becomes the channel of unexpected blessing. The narrative mixes humor, tension, and prophetic irony as curses flip into praise, and Israel’s destiny resists outside attempts to derail it. The parsha ends with moral pitfalls and the cost of alliances that betray covenantal boundaries."
  },
  {
    "id": 20,
    "englishName": "Pinchas",
    "hebrewName": "פנחס",
    "book": "Numbers",
    "refs": "Numbers 25:10–30:1",
    "shortSummary": "Zeal and renewal: acts that stop tragedy and the reaffirmation of vows and leadership.",
    "summary": "Pinchas is notable for a violent but pivotal act that stops a destructive pattern, and for which he receives a priestly covenant. The parsha also lists the inheritance rules, vows, and offerings — practical legalities that restore order and religious life. It’s a chapter about zeal tempered by structure: the community must balance passionate defense of values with measured law and ritual that sustain long-term identity."
  },
  {
    "id": 21,
    "englishName": "Matot",
    "hebrewName": "מטות",
    "book": "Numbers",
    "refs": "Numbers 30:2–32:42",
    "shortSummary": "Oaths, tribal responsibilities, and decisions about settlement east of the Jordan.",
    "summary": "Matot begins with intimate laws about vows — how spoken promises affect individuals and families — and moves to tribal politics and negotiation. Some tribes request land east of the Jordan; Moses navigates promises and the obligations of warfare. The parsha shows that the life of a people depends on pacts large and small, and that leadership often involves balancing private conscience with public duty."
  },
  {
    "id": 22,
    "englishName": "Masei",
    "hebrewName": "מסעי",
    "book": "Numbers",
    "refs": "Numbers 33:1–36:13",
    "shortSummary": "A catalog of the journey’s camps and final arrangements for inheritance.",
    "summary": "Masei reads like a travelogue — a poetic list of every encampment from Egypt to the plains of Moab — turning memory into sacred geography. It recalls how far the people have come and cements lessons from their wandering. The parsha ends with laws about land boundaries, cities of refuge, and ensuring that daughters and tribes receive just inheritances. Memory, law, and a horizon of settlement converge as Israel prepares for the land."
  },
  {
    "id": 23,
    "englishName": "Devarim",
    "hebrewName": "דברים",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 1:1–3:22",
    "shortSummary": "Moses begins his farewell speeches, reminding the people of their past and duties ahead.",
    "summary": "The opening of Deuteronomy is Moses’ voice across the plain: a leader in exile offering final sermons. He recounts failures and victories, urges faithfulness, and reframes law as covenantal memory. This parsha invites the people to listen, repent, and choose life as they prepare to cross into the land they were promised. It’s a tonal shift — from law as instruction to law as spoken plea and covenantal narrative."
  },
  {
    "id": 24,
    "englishName": "Va’etchanan",
    "hebrewName": "ואתחנן",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 3:23–7:11",
    "shortSummary": "Moses prays to enter the land, delivers the Shema, and urges wholehearted devotion.",
    "summary": "Moses opens with a personal confession: he pleaded to enter Canaan but was denied. He then pivots to essential teaching — the Shema, a concise declaration of God’s unity and the call to love God with heart and soul. Moses frames the law in emotional and moral terms, urging the people to choose fidelity in life’s ordinary moments: home, work, and family. The parsha is both intimate and foundational."
  },
  {
    "id": 25,
    "englishName": "Eikev",
    "hebrewName": "עקב",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 7:12–11:25",
    "shortSummary": "Blessings for obedience, warnings against complacency, and the rhythms of gratitude.",
    "summary": "Eikev reflects on how small daily actions — a simple obedience — yield large blessings. Moses warns against forgetting the hard lessons of dependence on God: prosperity can breed arrogance and erosion of memory. The parsha urges gratitude, regular teaching to children, and attentive care to covenantal values. It’s a moral call to keep the heart soft and the memory alive even in comfortable times."
  },
  {
    "id": 26,
    "englishName": "Re’eh",
    "hebrewName": "ראה",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 11:26–16:17",
    "shortSummary": "Choices between blessing and curse and instructions for worship and justice.",
    "summary": "Re’eh frames life as a choice between blessing and curse, holding people responsible for communal decisions. Ritual life — central sanctuary, annual festivals, and fair use of property — is tied to justice: leaving gleanings for the poor and honest judgment are part of worship. The parsha intertwines ritual observance with social ethics, suggesting that holiness is measured by how a community treats its vulnerable members."
  },
  {
    "id": 27,
    "englishName": "Shoftim",
    "hebrewName": "שופטים",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 16:18–21:9",
    "shortSummary": "Judges, kings, and the structures that safeguard justice and leadership.",
    "summary": "Shoftim lays a blueprint for governance: judges, impartial courts, and rules for kingship that restrain power. The text insists on fair procedures, limits on authority, and the importance of local adjudication. Prophets and priests have distinct roles, preserving a balance between civic order and spiritual accountability. The parsha is a reminder that political structures must defend dignity and community life, not merely power."
  },
  {
    "id": 28,
    "englishName": "Ki Teitzei",
    "hebrewName": "כי תצא",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 21:10–25:19",
    "shortSummary": "A collection of laws dealing with everyday life, war, family, and neighborly ethics.",
    "summary": "Ki Teitzei reads as a legal guide to life: rules about warfare, marriage, inheritance, and responsibility toward neighbors. While some laws feel foreign to modern eyes, many reflect a profound concern for dignity — protections for the vulnerable, fair treatment of captives, and limits on vengeance. The variety of topics shows how law aims to channel human instincts toward ordered compassion and communal flourishing."
  },
  {
    "id": 29,
    "englishName": "Ki Tavo",
    "hebrewName": "כי תבוא",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 26:1–29:8",
    "shortSummary": "Offerings of gratitude, the covenant’s blessings and curses, and a call to accountability.",
    "summary": "Ki Tavo begins with an agricultural ritual of gratitude — offering the first fruits — and blossoms into a sweeping covenantal sermon. Moses sets out blessings for obedience and dire warnings for betrayal of the terms. The ritual life is inseparable from moral choice; the parsha makes clear that communal fate depends on faithful living, and the language is stark, poetic, and urgent."
  },
  {
    "id": 30,
    "englishName": "Nitzavim",
    "hebrewName": "נצבים",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 29:9–30:20",
    "shortSummary": "An exhortation to choose life: return, repentance, and the promise of renewal.",
    "summary": "Nitzavim gathers the people at the covenantal crossroads and reminds them that the choice between life and death is immediate and personal. Moses proclaims that return and repentance are possible — even central — and that God’s law is not distant but near to each heart. The parsha’s tone is pastoral and hopeful, insisting that change is within grasp if people turn back with sincerity."
  },
  {
    "id": 31,
    "englishName": "Vayelech",
    "hebrewName": "וילך",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 31:1–30",
    "shortSummary": "Moses passes leadership to Joshua and commissions the public reading of the law.",
    "summary": "In Vayelech, Moses senses his time is nearly done and formally hands the reins to Joshua. He calls for the law to be publicly read every seven years so that memory will shape future generations. There’s a ritual of continuity here: authority transfers, but the covenant endures through communal commitment to listening and living the law aloud and together."
  },
  {
    "id": 32,
    "englishName": "Haazinu",
    "hebrewName": "האזינו",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 32:1–52",
    "shortSummary": "A poetic ‘song of Moses’ that recounts God’s faithfulness and human unfaithfulness.",
    "summary": "Haazinu reads as a prophetic song: music for memory. Moses recites Israel’s history in lyrical form, balancing divine steadfastness against human infidelity. The imagery is vivid, the warnings sobering, and the hope persistent: despite failures, a narrative of renewal remains. The song functions as both warning and testimony for generations yet to come."
  },
  {
    "id": 33,
    "englishName": "Vezot Haberakhah",
    "hebrewName": "וזאת הברכה",
    "book": "Deuteronomy",
    "refs": "Deuteronomy 33:1–34:12",
    "shortSummary": "Moses blesses the tribes and the Torah closes with his death on Mount Nebo.",
    "summary": "The final parsha is Moses’ farewell blessing to the tribes, a mosaic of images that foretells each tribe’s character and future. He climbs Mount Nebo, sees the land he will not enter, and dies — an ending both poignant and dignified. The Torah closes on a note of leadership fulfilled, transition assured, and a people left to carry the story forward."
  },
  {
    "id": 34,
    "englishName": "Vayikra",
    "hebrewName": "ויקרא",
    "book": "Leviticus",
    "refs": "Leviticus 1:1–5:26",
    "shortSummary": "Priestly laws of sacrifice introducing themes of holiness and atonement.",
    "summary": "Vayikra opens the book of Leviticus with intricate instructions for offerings — burnt, grain, and sin offerings — that structure communal and personal approaches to atonement. The rituals may feel distant, but they point to a human yearning to repair relationships and restore wholeness. The language is precise and the aim clear: holiness requires concrete acts that transform ordinary life into sacred practice."
  },
  {
    "id": 35,
    "englishName": "Tzav",
    "hebrewName": "צו",
    "book": "Leviticus",
    "refs": "Leviticus 6:1–8:36",
    "shortSummary": "Further sacrificial rules and the consecration of Aaron and his sons.",
    "summary": "Tzav continues the sacrificial handbook and focuses on priestly service, including the consecration rites for Aaron and his sons. A public ceremony consecrates a family into sacred duty, blending ritual, music, and communal presence. The parsha shows how religious roles are formed, maintained, and imbued with communal meaning."
  },
  {
    "id": 36,
    "englishName": "Shemini",
    "hebrewName": "שמיני",
    "book": "Leviticus",
    "refs": "Leviticus 9:1–11:47",
    "shortSummary": "The Tabernacle comes alive and tragedy strikes with Nadav and Avihu.",
    "summary": "On the eighth day the Tabernacle’s service begins and God appears with fire — a moment of sanctity and fulfillment. Yet joy is pierced by sudden tragedy when Nadav and Avihu offer unauthorized fire and perish, a shocking lesson about reverence and boundaries. The parsha also presents distinctions between clean and unclean animals, reminding the community that identity includes everyday practices that shape holiness."
  },
  {
    "id": 37,
    "englishName": "Tazria",
    "hebrewName": "תזריע",
    "book": "Leviticus",
    "refs": "Leviticus 12:1–13:59",
    "shortSummary": "Laws about birth, ritual impurity, and skin afflictions that touch community life.",
    "summary": "Tazria addresses life’s intimate edges — childbirth rituals and the complex rules around ritual impurity, including skin conditions often translated as leprosy. These laws regulate how a community remains healthy, safe, and ritually whole while also treating individuals with dignity. The parsha explores how physical conditions intersect with social life and religious care."
  },
  {
    "id": 38,
    "englishName": "Metzora",
    "hebrewName": "מצורע",
    "book": "Leviticus",
    "refs": "Leviticus 14:1–15:33",
    "shortSummary": "Purification rites and social reintegration after illness or impurity.",
    "summary": "Metzora continues the theme of restoration: rituals for purification enable those who were isolated by disease to re-enter communal life. The ceremonies mix practical hygiene, symbolic acts, and offerings that acknowledge vulnerability and renew belonging. The parsha invites compassion within structure and shows how communities can hold both caution and welcome."
  },
  {
    "id": 39,
    "englishName": "Acharei Mot",
    "hebrewName": "אחרי מות",
    "book": "Leviticus",
    "refs": "Leviticus 16:1–18:30",
    "shortSummary": "Yom Kippur rituals and moral laws about intimacy and holiness.",
    "summary": "Acharei Mot centers on the Day of Atonement — the high priest’s solemn service that reaches into the heart of communal forgiveness. It then moves to laws of forbidden relations, underlining the sacredness of family boundaries. The parsha juxtaposes intense liturgy with moral instruction, framing atonement as both ritual and ethical reformation."
  },
  {
    "id": 40,
    "englishName": "Kedoshim",
    "hebrewName": "קדושים",
    "book": "Leviticus",
    "refs": "Leviticus 19:1–20:27",
    "shortSummary": "‘You shall be holy’ — a rich mosaic of commandments about neighborliness and justice.",
    "summary": "Kedoshim offers a dense, practical theology of holiness: loving the stranger, honest business, fair justice, and humility before God. Famous lines — like 'Love your neighbor as yourself' — anchor a vision of society where ethics and holiness merge. The parsha shows that sanctity is not only for the sanctuary but for every encounter, contract, and act of care."
  },
  {
    "id": 41,
    "englishName": "Emor",
    "hebrewName": "אמור",
    "book": "Leviticus",
    "refs": "Leviticus 21:1–24:23",
    "shortSummary": "Priestly rules, the calendar of holy days, and stories about justice in sacred space.",
    "summary": "Emor clarifies the conduct of priests and sets the rhythm of sacred time with festivals and holy days. The parsha also recounts episodes such as the blasphemer’s punishment and the strange case of accidental death at Gibeah — legal stories that insist on reverence and social order. Emor connects ritual responsibility with societal justice."
  },
  {
    "id": 42,
    "englishName": "Behar",
    "hebrewName": "בהר",
    "book": "Leviticus",
    "refs": "Leviticus 25:1–26:2",
    "shortSummary": "Laws of the Sabbatical year and Jubilee: economic reset and compassion for the land and the poor.",
    "summary": "Behar introduces radical ideas about time and property: every seventh year the land rests, and in Jubilee the community resets debts and releases people from servitude. These laws are an ethic of compassion that counters inequality and yearly accumulation. The parsha invites a rhythm where land and people are reminded they are not mere commodities but share in a sacred economy of fairness."
  },
  {
    "id": 43,
    "englishName": "Bechukotai",
    "hebrewName": "בחוקתי",
    "book": "Leviticus",
    "refs": "Leviticus 26:3–27:34",
    "shortSummary": "Blessings for faithfulness, warnings for disobedience, and laws about vows.",
    "summary": "Bechukotai pairs joyous promises for obedience with stark consequences for turning away. The poetic blessings paint a flourishing land and protective favor, while the curses are sober reminders of the cost of collective turning. The section also handles vows and dedication, emphasizing integrity between promises and practice in communal life."
  },
  {
    "id": 44,
    "englishName": "Bamidbar (again)",
    "hebrewName": "במדבר",
    "book": "Numbers",
    "refs": "Numbers 1–4 (various)",
    "shortSummary": "A return to numerical ordering and preparing the people for life in the desert.",
    "summary": "Often paired with earlier Bamidbar readings, these chapters return readers to the practicalities of covenantal community: census, the Levites’ roles, and the careful ordering of a mobile society. The parsha reemphasizes how freedom must become structure if it is to endure as communal flourishing."
  },
  {
    "id": 45,
    "englishName": "Naso (repeat)",
    "hebrewName": "נשא",
    "book": "Numbers",
    "refs": "Numbers 4–7 (various)",
    "shortSummary": "Continuing detailed duties for the Levites and the Tabernacle dedication.",
    "summary": "These readings expand on the Levites’ functions and celebrate the Tabernacle’s dedication. The priestly blessing shines like a benediction for daily life, and the communal offerings highlight joy in collective worship. The text shows how ritual care can knit communities together."
  },
  {
    "id": 46,
    "englishName": "Devarim (repeat)",
    "hebrewName": "דברים",
    "book": "Deuteronomy",
    "refs": "Various excerpts of Moses’ speeches",
    "shortSummary": "Selected passages of Moses’ farewell speeches and covenant renewal.",
    "summary": "These Deuteronomic selections concentrate on Moses’ core speeches — reframing history and law into a final moral teaching. The tone is testimonial and hortatory: Moses calls for faithfulness as the people prepare to enter the land. It’s a final pastoral charge meant to keep memory alive long after a leader’s passing."
  },
  {
    "id": 47,
    "englishName": "Va’eira (Alt)",
    "hebrewName": "וארא",
    "book": "Exodus",
    "refs": "Exodus 6–9 (alt sections)",
    "shortSummary": "Alternate readings of the early plague cycle focusing on revelation and confrontation.",
    "summary": "Some communities divide the plague narratives differently; these alternate readings still explore God’s revelation to Moses and the mounting conflict with Pharaoh. The plagues function as both cosmic judgments and personal tests of courage for Moses and resilience for Israel."
  },
  {
    "id": 48,
    "englishName": "Chukat (alt)",
    "hebrewName": "חקת",
    "book": "Numbers",
    "refs": "Alternate selections",
    "shortSummary": "Alternate portion readings emphasizing law and leadership’s vulnerability.",
    "summary": "Depending on tradition, Chukat’s readings can be arranged to emphasize ritual law or the human drama of Moses’ leadership. The red heifer and the waters of Meribah remain central, raising questions about ritual, mortality, and accountability."
  },
  {
    "id": 49,
    "englishName": "Masei (alt)",
    "hebrewName": "מסעי",
    "book": "Numbers",
    "refs": "Numbers 33:1–36:13 (alternate)",
    "shortSummary": "An alternate reading of the travel list and final laws before entering the land.",
    "summary": "Masei’s travel itinerary can be read in different groupings, but its purpose is constant: to bind memory and law so a people will not forget the path that formed them. It anchors the community’s story in place and time."
  },
  {
    "id": 50,
    "englishName": "Shemini (Alt)",
    "hebrewName": "שמיני",
    "book": "Leviticus",
    "refs": "Leviticus 9–11 (alternate)",
    "shortSummary": "Alternate reading highlighting the Tabernacle’s inauguration and dietary laws.",
    "summary": "These alternate divisions focus attention on the sacred inauguration of service and the everyday holiness of eating choices, connecting ritual with daily habit."
  },
  {
    "id": 51,
    "englishName": "Acharei Mot-Kedoshim",
    "hebrewName": "אחרי מות־קדושים",
    "book": "Leviticus",
    "refs": "Leviticus 16–20",
    "shortSummary": "A combined reading emphasizing atonement, moral law, and the call to holiness.",
    "summary": "Some cycles combine Acharei Mot and Kedoshim to weave atonement rituals with ethical commandments. The result is a layered message: individual purification is paired with communal justice and neighborly love, forming a full picture of what holiness demands."
  },
  {
    "id": 52,
    "englishName": "Behar-Bechukotai",
    "hebrewName": "בהר־בחוקתי",
    "book": "Leviticus",
    "refs": "Leviticus 25–27",
    "shortSummary": "Sabbatical and Jubilee laws alongside blessings and warnings for collective life.",
    "summary": "When read together, these chapters bind economic compassion with moral consequence: sabbatical rhythms refresh land and souls; covenantal blessings offer flourishing, while curses warn of neglect. The pairing underlines an ethic of time, stewardship, and social justice."
  },
  {
    "id": 53,
    "englishName": "Vayikra (alt)",
    "hebrewName": "ויקרא",
    "book": "Leviticus",
    "refs": "Leviticus 1–5 (alternate passages)",
    "shortSummary": "Alternate approach to sacrificial material emphasizing ritual meaning.",
    "summary": "Alternate readings of Vayikra invite readers to dwell on the symbolism of offerings: not mere mechanics, but acts that express repentance, gratitude, and communal repair."
  },
  {
    "id": 54,
    "englishName": "Summary Parsha (misc)",
    "hebrewName": "סיכום פרשה",
    "book": "Various",
    "refs": "Various cross-references",
    "shortSummary": "A catch-all entry to support site features needing a generic summary.",
    "summary": "This entry exists to support UI elements that require a neutral summary or index entry for editorial or display purposes. It can be used as a fallback when a weekly parsha is not otherwise available."
  }
]